benchBNB/app/controllers/api/benches_controller.rb

    def create
        @bench = Bench.new(bench_params)
        if @bench.save
---
INSERT INTO "benches" ("description", "lat", "lng", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "test!"], ["lat", 37.7774296], ["lng", -122.4256606], ["created_at", "2022-06-15 19:42:52.178705"], ["updated_at", "2022-06-15 19:42:52.178705"]]